<?php
/**
 * Используется для добавления новых строк в бюджет бюджета
 */
namespace app\models;

use Yii;
use yii\base\Model;
use yii\behaviors\TimestampBehavior;
use yii\data\ActiveDataProvider;
use app\models\User;

class Budget extends \yii\db\ActiveRecord
{

    public static function tableName()
    {
        return 'budget';
    }

    public function attributeLabels()
    {
        return [
            'id' => 'ID',
            'kol' => 'Кількість',
            'name_service' => 'Підрозділ:',
            'name_tmc' => 'Товар',
            'spec' => 'Розділ закупівель',
            'page_b' => 'Стаття бюджету',
            'type_repair' => 'Вид ремонту',
            'name_act' => 'Тип діяльності',
            'type_tmc' => 'Вид ТМЦ',
            'obj' => 'Назва обʼєкту',
            'lot' => 'Лот',
            'dname_obj' => 'Дисп. назва обʼекта',
            'dname' => 'Дисп. назва обʼекта',
            'edizm' => 'Од.вим.',
            'price' => 'Ціна',
            'q_1' => 'Січень,кільк.',
            'p_1' => 'Січень,варт.',
            'q_2' => 'Лютий,кільк.',
            'p_2' => 'Лютий,варт.',
            'q_3' => 'Березень,кільк.',
            'p_3' => 'Березень,варт.',
            'aq_1' => '1 квартал,кільк.',
            'ap_1' => '1 квартал,варт.',
            'q_4' => 'Квітень,кільк.',
            'p_4' => 'Квітень,варт.',
            'q_5' => 'Травень,кільк.',
            'p_5' => 'Травень,варт.',
            'q_6' => 'Червень,кільк.',
            'p_6' => 'Червень,варт.',
            'aq_2' => '2 квартал,кільк.',
            'ap_2' => '2 квартал,варт.',
            'q_7' => 'Липень,кільк.',
            'p_7' => 'Липень,варт.',
            'q_8' => 'Серпень,кільк.',
            'p_8' => 'Серпень,варт.',
            'q_9' => 'Вересень,кільк.',
            'p_9' => 'Вересень,варт.',
            'aq_3' => '3 квартал,кільк.',
            'ap_3' => '3 квартал,варт.',
            'q_10' => 'Жовтень,кільк.',
            'p_10' => 'Жовтень,варт.',
            'q_11' => 'Листопад,кільк.',
            'p_11' => 'Листопад,варт.',
            'q_12' => 'Грудень,кільк.',
            'p_12' => 'Грудень,варт.',
            'aq_4' => '4 квартал,кільк.',
            'ap_4' => '4 квартал,варт.',
            'year_q' => 'за рік,кільк.',
            'year_p' => 'за рік,варт.',

            'rq_1' => 'Січень,кільк.(отрим. РЕМ)',
            'rp_1' => 'Січень,варт.(отрим. РЕМ тисяч грн.)',
            'up_1' => 'Січень,варт.(використ. РЕМ тисяч грн.)',
            'oq_1' => 'Січень,кільк.(використ. РЕМ)',
            'rq_2' => 'Лютий,кільк.(отрим. РЕМ)',
            'rp_2' => 'Лютий,варт.(отрим. РЕМ тисяч грн.)',
            'up_2' => 'Лютий,варт.(використ. РЕМ тисяч грн.)',
            'oq_2' => 'Лютий,кільк.(використ. РЕМ)',
            'rq_3' => 'Березень,кільк.(отрим. РЕМ)',
            'rp_3' => 'Березень,варт.(отрим. РЕМ тисяч грн.)',
            'up_3' => 'Березень,варт.(використ. РЕМ тисяч грн.)',
            'oq_3' => 'Березень,кільк.(використ. РЕМ)',

            'v1' => 'Січень,кільк.(видано. РЕМ)',
            'v2' => 'Лютий,кільк.(видано. РЕМ)',
            'v3' => 'Березень,кільк.(видано. РЕМ)',
            'v4' => 'Квітень ,кільк.(видано. РЕМ)',
            'v5' => 'Травень ,кільк.(видано. РЕМ)',
            'v6' => 'Червень ,кільк.(видано. РЕМ)',
            'v7' => 'Липень ,кільк.(видано. РЕМ)',
            'v8' => 'Серпень ,кільк.(видано. РЕМ)',
            'v9' => 'Вересень ,кільк.(видано. РЕМ)',
            'v10' => 'Жовтень ,кільк.(видано. РЕМ)',
            'v11' => 'Листопад ,кільк.(видано. РЕМ)',
            'v12' => 'Грудень ,кільк.(видано. РЕМ)',

            'rq_4' => 'Квітень,кільк.(отрим. РЕМ)',
            'rp_4' => 'Квітень,варт.(отрим. РЕМ тисяч грн.)',
            'up_4' => 'Квітень,варт.(використ. РЕМ тисяч грн.)',
            'oq_4' => 'Квітень,кільк.(використ. РЕМ)',
            'rq_5' => 'Травень,кільк.(отрим. РЕМ)',
            'rp_5' => 'Травень,варт.(отрим. РЕМ тисяч грн.)',
            'up_5' => 'Травень,варт.(використ. РЕМ тисяч грн.)',
            'oq_5' => 'Травень,кільк.(використ. РЕМ)',
            'rq_6' => 'Червень,кільк.(отрим. РЕМ)',
            'rp_6' => 'Червень,варт.(отрим. РЕМ тисяч грн.)',
            'up_6' => 'Червень,варт.(використ. РЕМ тисяч грн.)',
            'oq_6' => 'Червень,кільк.(використ. РЕМ)',

            'rq_7' => 'Липень,кільк.(отрим. РЕМ)',
            'rp_7' => 'Липень,варт.(отрим. РЕМ тисяч грн.)',
            'up_7' => 'Липень,варт.(використ. РЕМ тисяч грн.)',
            'oq_7' => 'Липень,кільк.(використ. РЕМ)',
            'rq_8' => 'Серпень,кільк.(отрим. РЕМ)',
            'rp_8' => 'Серпень,варт.(отрим. РЕМ тисяч грн.)',
            'up_8' => 'Серпень,варт.(використ. РЕМ тисяч грн.)',
            'oq_8' => 'Серпень,кільк.(використ. РЕМ)',
            'rq_9' => 'Вересень,кільк.(отрим. РЕМ)',
            'rp_9' => 'Вересень,варт.(отрим. РЕМ тисяч грн.)',
            'up_9' => 'Вересень,варт.(використ. РЕМ тисяч грн.)',
            'oq_9' => 'Вересень,кільк.(використ. РЕМ)',

            'rq_10' => 'Жовтень,кільк.(отрим. РЕМ)',
            'rp_10' => 'Жовтень,варт.(отрим. РЕМ тисяч грн.)',
            'up_10' => 'Жовтень,варт.(використ. РЕМ тисяч грн.)',
            'oq_10' => 'Жовтень,кільк.(використ. РЕМ)',
            'rq_11' => 'Листопад,кільк.(отрим. РЕМ)',
            'rp_11' => 'Листопад,варт.(отрим. РЕМ тисяч грн.)',
            'up_11' => 'Листопад,варт.(використ. РЕМ тисяч грн.)',
            'oq_11' => 'Листопад,кільк.(використ. РЕМ)',
            'rq_12' => 'Грудень,кільк.(отрим. РЕМ)',
            'rp_12' => 'Грудень,варт.(отрим. РЕМ тисяч грн.)',
            'up_12' => 'Грудень,варт.(використ. РЕМ тисяч грн.)',
            'oq_12' => 'Грудень,кільк.(використ. РЕМ)',

            'rn_1' => 'Січень,кільк.(не викорис. РЕМ)',
            'rn_2' => 'Лютий,кільк.(не викорис. РЕМ)',
            'rn_3' => 'Березень,кільк.(не викорис. РЕМ)',
            'rn_4' => 'Квітень,кільк.(не викорис. РЕМ)',
            'rn_5' => 'Травень,кільк.(не викорис. РЕМ)',
            'rn_6' => 'Червень,кільк.(не викорис. РЕМ)',
            'rn_7' => 'Липень,кільк.(не викорис. РЕМ)',
            'rn_8' => 'Серпень,кільк.(не викорис. РЕМ)',
            'rn_9' => 'Вересень,кільк.(не викорис. РЕМ)',
            'rn_10' => 'Жовтень,кільк.(не викорис. РЕМ)',
            'rn_11' => 'Листопад,кільк.(не викорис. РЕМ)',
            'rn_12' => 'Грудень,кільк.(не викорис. РЕМ)',

            'rz_1' => 'Січень,кільк.(не отрим. РЕМ)',
            'rz_2' => 'Лютий,кільк.(не отрим. РЕМ)',
            'rz_3' => 'Березень,кільк.(не отрим. РЕМ)',
            'rz_4' => 'Квітень,кільк.(не отрим. РЕМ)',
            'rz_5' => 'Травень,кільк.(не отрим. РЕМ)',
            'rz_6' => 'Червень,кільк.(не отрим. РЕМ)',
            'rz_7' => 'Липень,кільк.(не отрим. РЕМ)',
            'rz_8' => 'Серпень,кільк.(не отрим. РЕМ)',
            'rz_9' => 'Вересень,кільк.(не отрим. РЕМ)',
            'rz_10' => 'Жовтень,кільк.(не отрим. РЕМ)',
            'rz_11' => 'Листопад,кільк.(не отрим. РЕМ)',
            'rz_12' => 'Грудень,кільк.(не отрим. РЕМ)',

            'rx_1' => 'Січень,варт.(не отрим. РЕМ)',
            'rx_2' => 'Лютий,варт.(не отрим. РЕМ)',
            'rx_3' => 'Березень,варт.(не отрим. РЕМ)',
            'rx_4' => 'Квітень,варт.(не отрим. РЕМ)',
            'rx_5' => 'Травень,варт.(не отрим. РЕМ)',
            'rx_6' => 'Червень,варт.(не отрим. РЕМ)',
            'rx_7' => 'Липень,варт.(не отрим. РЕМ)',
            'rx_8' => 'Серпень,варт.(не отрим. РЕМ)',
            'rx_9' => 'Вересень,варт.(не отрим. РЕМ)',
            'rx_10' => 'Жовтень,варт.(не отрим. РЕМ)',
            'rx_11' => 'Листопад,варт.(не отрим. РЕМ)',
            'rx_12' => 'Грудень,варт.(не отрим. РЕМ)',

            'nakop' => 'підсумок отримано,кільк.',
            'nakop_s' => 'підсумок отримано,варт.',
            'nakop_o' => 'підсумок списано,кільк.',
            'nakop_q' => 'підсумок замовлено,кільк.',
            'nakop_p' => 'підсумок замовлено,варт.',
            'nakop_n' => 'підсумок не використ,кільк.',
            'nakop_z' => 'підсумок не отримано,кільк.',
            'nakop_x' => 'підсумок не отримано,варт',
            'nakop_v' => 'підсумок видано РЕМ,кільк.',
            'nakop_y' => 'підсумок не отримано факт.,кільк.',

               ];
    }
    public function rules()
    {
        return [
            [['ID','service','name_tmc',
                'spec','page_b','type_repair','type_act','type_tmc','obj',
                'lot','dname_obj','price','ed_izm','q_1',
                'q_2','q_3','q_4','q_5','q_6',
                'q_7','q_7','q_8','q_9','q_10','q_11','q_12',
                'p_1','p_2','p_3','p_4','p_5','p_6','p_7',
                'p_8','p_9','p_10','p_11','p_12','aq_1','ap_1',
                'aq_2','ap_2','aq_3','ap_3','aq_4','ap_4',
                'year_q','year_p','edizm','name_obj','name_act',
                'vid_tmc','page','name_spec','vid_repair',
                'name_service',
                'rq_1',
                'rq_2','rq_3','rq_4','rq_5','rq_6',
                'rq_7','rq_7','rq_8','rq_9','rq_10','rq_11','rq_12',
                'rp_1','rp_2','rp_3','rp_4','rp_5','rp_6','rp_7',
                'rp_8','rp_9','rp_10','rp_11','rp_12',
                'oq_1',
                'oq_2','oq_3','oq_4','oq_5','oq_6',
                'oq_7','oq_7','oq_8','oq_9','oq_10','oq_11','oq_12',
                'rn_1',
                'rn_2','rn_3','rn_4','rn_5','rn_6',
                'rn_7','rn_7','rn_8','rn_9','rn_10','rn_11','rn_12',
                'rz_1',
                'rz_2','rz_3','rz_4','rz_5','rz_6',
                'rz_7','rz_7','rz_8','rz_9','rz_10','rz_11','rz_12',
                'rx_1',
                'rx_2','rx_3','rx_4','rx_5','rx_6',
                'rx_7','rx_7','rx_8','rx_9','rx_10','rx_11','rx_12',
                'up_1','up_2','up_3','up_4','up_5','up_6','up_7','up_8',
                'up_9','up_10','up_11','up_12',
                'id_budget',
                'nakop','nakop_s','nakop_o','nakop_q','nakop_p',
                'nakop_n','nakop_z','nakop_x','nakop_v','nakop_y','kol'
                ],'safe'
            ]];
    }


    public function search($params,$sql)
    {
        $session = Yii::$app->session;
        $session->open();
        if($session->has('user'))
            $user = $session->get('user');
        else
            $user = '';

        // $query = tovar::find()->where('rem=:rem',[':rem' => $user]);
        $query = view_budget::findBySql($sql);
        $query->sql = $sql;

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
            'sort' => ['defaultOrder'=> ['name_service'=>SORT_DESC]]
        ]);
        if (!($this->load($params) && $this->validate())) {
            return $dataProvider;
        }

        $query->andFilterWhere(['like', 'name_tmc', $this->name_tmc]);

        return $dataProvider;
    }



    public function getId()
    {
        return $this->getPrimaryKey();
    }

    public static function getDb()
    {
            return Yii::$app->get('db');
    }
}


